src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненыеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РазмерОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	 
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
  
    Если ЭтоНовый() Тогда
        
         СписокИзменений = "";
             
        СписокИзменений = СписокИзменений + Номер + " " + Формат(Дата, "ДЛФ=DD.MM.YYYY")  + " " + Специалист + " " + Формат(ДатаПроведенияРабот, "ДЛФ=DD.MM.YYYY");
                
        ДобавитьСообщениеВИсторию(СписокИзменений);
        
    Иначе
       
        СтарыйОбъект = Ссылка.ПолучитьОбъект();
        
        СписокИзменений = Номер + " ";
        
        Если СтарыйОбъект.Дата <> Дата Тогда
            СписокИзменений = СписокИзменений + "Дата и время изменены с " + СтарыйОбъект.Дата + " на " + Формат(Дата, "ДЛФ=DD.MM.YYYY") + ". ";
        КонецЕсли;
        
        
        Если СтарыйОбъект.Специалист <> Специалист Тогда
            СписокИзменений = СписокИзменений + "Специалист изменен с " + СтарыйОбъект.Специалист + " на " + Специалист + ". ";
        КонецЕсли;
        
         Если СтарыйОбъект.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
            СписокИзменений = СписокИзменений + "Дата проведения работ изменена " + СтарыйОбъект.ДатаПроведенияРабот + " на " + Формат(ДатаПроведенияРабот, "ДЛФ=DD.MM.YYYY") + ". ";
        КонецЕсли;
              
        Если СписокИзменений <> "" Тогда
            ДобавитьСообщениеВИсторию(СписокИзменений);
        КонецЕсли;
    КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСообщениеВИсторию(СписокИзменений)
    
    НоваяЗапись = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
    
    НоваяЗапись.ТекстСообщения = СписокИзменений;
    
    НоваяЗапись.Записать();

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Если Не ЗначениеЗаполнено(Договор) Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор не выбран.");
        Отказ = Истина;
	КонецЕсли;
	
	ТекущиеДанныеДоговор = Договор.ВидДоговора;
	    
    Если ТекущиеДанныеДоговор = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
    
	    Если Дата < Договор.ВКМ_НачалоДействияДоговора Тогда
	    	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа не соответствует сроку действия договора");
	    	Отказ = Истина;
	    	ИначеЕсли  Дата > Договор.ВКМ_ОкончаниеДействияДоговора Тогда
	        	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата документа не соответствует сроку действия договора.");
	        	Отказ = Истина;
	        
	    КонецЕсли;
    
    КонецЕсли;
  
    ТекущиеДанныеТаблицы = ВыполненыеРаботы.Выгрузить();
    
    СтоимостьЧаса = Договор.ВКМ_СтоимостьЧасаРаботы;
   
	
	
	Для Каждого Строка Из ВыполненыеРаботы Цикл
		КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
	

	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = КоличествоЧасов;
	Движение.СуммаКОплате = СтоимостьЧаса*КоличествоЧасов;	
	
	КонецЦикла;
	
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	
	// Получаем процент из регистра сведений УсловияОплатыСотрудников
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК Процент
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сотруднику не установлены условия оплаты на дату документа!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Процент = Выборка.Процент;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧаса,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Договор = &Договор
		|	И ВКМ_ОбслуживаниеКлиентов.Специалист = &Специалист";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	
	// Формирование движения
	Для Каждого ТекСтрокаВыполненыеРаботы из ВыполненыеРаботы Цикл
		СуммаДляСотрудника = (ТекСтрокаВыполненыеРаботы.ЧасыКОплатеКлиенту * СтоимостьЧаса * Процент) / 100;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;

		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненыеРаботы.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = СуммаДляСотрудника;
	КонецЦикла;
	
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтВыплат;
	Движение.ПериодРегистрации = ДатаПроведенияРабот;
	Движение.ПериодДействияНачало = НачалоМесяца(ДатаПроведенияРабот);
	Движение.ПериодДействияКонец = КонецМесяца(ДатаПроведенияРабот);
	Движение.БазовыйПериодНачало = НачалоМесяца(ДатаПроведенияРабот);
	Движение.БазовыйПериодКонец = КонецМесяца(ДатаПроведенияРабот);
	Движение.Сотрудник = Специалист;
	Движение.Результат = СуммаДляСотрудника;
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ


	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

   
	
КонецПроцедуры
